% 线性规划例1
% max  z=3*x1+x2
% s.t.-x1+x2   <=2    <== x1-x2>=-2 
%      x1-2*x2 <=2
%    3*x1+2*x2 <=14
%      x1,x2>=0
c=-[3,1];A=[-1,1;1,-2;3,2];b=[2,2,14];
v1=[0 0];   

% 最简单的实现
[x,f,exitflag,output,lag]=linprog(c,A,b,[],[],v1)
zz=-f
z=-c*x  %x= (4,1),max z= 13



% 线性规划例2
% min  z=3*x1+x2-x3
% s.t. x1+x2-2*x3>=2
%      x1-2*x2+x3>=2
%      3*x1+2*x2-x3=14
%      x1,x2,x3>=0
c=[3,1,-1];A1=[1,1,-2;1,-2,1];A2=[3,2,-1];b1=[2,2];b2=14;v1=[0 0 0]; 

[x,z,exitflag,output,lag]=linprog(c,-A1,-b1,A2,b2,v1) 

% 改变参数, 目标值无界，无最优解 
[x,z,exitflag,output,lag]=linprog(c,A1,b1,A2,b2,v1)




% 奶制品的生产销售计划
c=[12 8 19.8 16 -1.5 -1.5];
%c=[12 8 22 16 -1.5 -1.5];
A1=[4 3 0 0 4 3;2 1 0 0 3 2;1 0 0 0 1 0];
b1=[600 240 100];
A2=[0 0 1 0 -0.8 0;0 0 0 1 0 -0.75];
b2=[0 0];
v1=[0 0 0 0 0 0];                                  
[x,z0,ef,out,lag]=linprog(-c,A1,b1,A2,b2,v1)
lag.ineqlin, lag.eqlin 




